vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.7.44" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.44/schema/PACK.xsd">
  <vendor>Infineon</vendor>
  <name>PSoC-HVMS_DFP</name>
  <description overview="Documentation/Overview.md">Infineon KIT_PSoC4-HVMS Device Family Pack</description>
  <url>https://itools.infineon.com/cmsis_packs/PSoC_HVMS/</url>
  <supportContact>https://www.infineon.com/support</supportContact>
  <license>APACHE_LICENSE.txt</license>
  <licenseSets>
    <licenseSet id="all" default="true" gating="true">
      <license name="./APACHE_LICENSE.txt" title="Apache 2.0 License" spdx="Apache-2.0"/>
    </licenseSet>
  </licenseSets>
  
  <releases>
    <release version="1.0.0" date="2025-10-17">
      Initial Version
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Infineon</keyword>
    <keyword>Device Support</keyword>
    <keyword>PSoC</keyword>
    <keyword>PSoC-HVMS</keyword>
  </keywords>

  <requirements>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>

  <devices>
    <family Dfamily="PSoC-HVMS" Dvendor="Infineon:7">
      <book name="https://developer.arm.com/documentation/dui0662/latest" title="Cortex-M0+ Generic User Guide"/>
      <feature type="Temp" n="-40" m="125" name="Extended Operating Temperature Range"/>
      <feature type="VCC" n="2.7" m="5.5"/>
      <feature type="MemoryOther" n="64" name="KB Code Flash"/> 
      <feature type="MemoryOther" n="128" name="KB Code Flash"/>
      <description>PSoC-HVMS devices</description>
      <sequences>
        <sequence name="ResetSystem">
          <block>
            // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;

            // Clear Reset Vector Catch bit set in ResetSetCatch (done so as not to redefine the default ResetSetCatch)
            Write32(DEMCR_Addr, (Read32(DEMCR_Addr) &amp; 0xFFFFFFFE));

            // Map the address bits to the breakpoint compare register
            // bit map, set the enable breakpoint bit, and the match bits
            __var reset_addr = (Read32(0x00000004) &amp; 0x1FFFFFFC) | 0x40000001;
            Write32(0xE0002008, reset_addr);

            // Enable Breakpoint unit
            Write32(0xE0002000, 0x00000003);

            // Issue software reset
            __errorcontrol = 1;
            Write32(AIRCR_Addr, 0x05FA0004);
            __errorcontrol = 0;

            // Wait 100ms to omit the DHCSR register reading until the device is ready
            DAP_Delay(100000);
          </block>
          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="5000" />
        </sequence>
        <sequence name="ResetHardware">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;

            // De-assert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000" />
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000" />
          </control>
          <control if="!canReadPins">
            <block>
              // Assert nRESET line
              DAP_SWJ_Pins(nReset, nReset, 0);
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000" />
          </control>
        </sequence>
        <!-- Does not unlock device. Reused for reading and printing device info -->
        <sequence name="DebugDeviceUnlock">
          <block>
            __var siId;
            __var siRev;
            __var siFamily;
            __var protection;
            __var v;
            __errorcontrol = 1;
            __var is_protected = Read32(0xE000ED00);
          </block>
          <control if="is_protected == 1">
            <block>
              is_protected = Read32(0xE000ED00);
            </block>
          </control>
          <control if="is_protected == 1">
            <block>
              is_protected = Read32(0xE000ED00);
            </block>
          </control>
          <block>
            __errorcontrol = 0;
          </block>
          <control if="is_protected == 1">
            <block>
              Message(0, "****************************************************");
              Message(0, "** Chip Protection: PROTECTED");
              Message(0, "****************************************************");
            </block>
          </control>
          <control if="is_protected != 1">
            <block>
              __var prot_offset;
              __var siid_offset;
              __var is_legacy = 0;
              __var geometry_address = 0x40110000;
              __var sflash_address = 0x0FFFF000;
              __var pid_0 = Read32(0xF0000FE0);
              __var pid_1 = Read32(0xF0000FE4);
              __var pid_2 = Read32(0xF0000FE8);
              __var pid_3 = Read32(0xF0000FEC);
              siFamily = pid_0 + ((pid_1 &amp; 0xFu) &lt;&lt; 8);
              siRev = (pid_2 &amp; 0xF0) + ((pid_3 &amp; 0xF0) &gt;&gt; 4);
            </block>
            <control if="(((siFamily&gt;=0x92) &amp;&amp; (siFamily&lt;0x97)) || siFamily==0x98 || siFamily==0x99 || siFamily==0x9C)">
              <block>
                is_legacy = 1;
              </block>
            </control>
            <control if="siFamily==0xBE">
              <block>
                sflash_address = 0x0FFFE000;
              </block>
            </control>
            <control if="is_legacy==1">
              <block>
                geometry_address = 0x400E0000;
              </block>
            </control>
            <!-- Get row size -->
            <block>
              v = Read32(geometry_address);
            </block>
            <control if="is_legacy==0">
              <block>
                v = (v &gt;&gt; 22) &amp; 0x03;
                v = 64 * (v + 1);
              </block>
            </control>
            <control if="is_legacy==1">
              <block>
                v = v * 128;
              </block>
            </control>
            <!-- Define silicon ID and protection offesets for 64 -->
            <control if="v == 0x40">
              <block>
                siid_offset = 0x0144;
                prot_offset = 0x7C;
              </block>
            </control>
            <!-- Define silicon ID and protection offesets for 128 -->
            <control if="v == 0x80">
              <block>
                siid_offset = 0x0144;
                prot_offset = 0x7C;
              </block>
            </control>
            <!-- Define silicon ID and protection offesets for 256 -->
            <control if="v == 0x100">
              <block>
                siid_offset = 0x244;
                prot_offset = 0x0FC;
              </block>
            </control>
            <!-- Read Silicon ID and protection values -->
            <block>
              siId = Read32(siid_offset|sflash_address);
              protection = Read32(prot_offset|sflash_address);
              Message(0, "****************************************************");
              Message(0, "** Silicon: 0x%04X, Family: 0x%02X, Rev.: 0x%02X", siId, siFamily, siRev);
            </block>
            <!-- Decode life-cycle stage -->
            <control if="protection == 0">
              <block>
                Message(0, "** Chip Protection: OPEN");
              </block>
            </control>
            <control if="protection == 1">
              <block>
                Message(0, "** Chip Protection: VIRGIN");
              </block>
            </control>
            <control if="(protection &gt; 1)">
              <block>
                Message(0, "** Chip Protection: UNKNOWN");
              </block>
            </control>
            <block>
              Message(0, "****************************************************");
            </block>
          </control>
        </sequence>
      </sequences>
      <subFamily DsubFamily="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx">
        <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" />
        <debug Pname="Cortex-M0p" svd="Libraries/mtb-pdl-cat2/devices/svd/psoc4hvms64k.svd" />
        <memory name="SRAM" access="rwx" start="0x20000000" size="0x00002000" default="1" />
        <memory name="FLASH" access="rx" start="0x00000000" size="0x00010000" default="1" startup="1" />
        <algorithm name="Flash/CAT2.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000300" RAMsize="0x00000D00" default="1" style="Keil" />
        <feature type="Memory" n="64" name="64KB FLASH Memory"/>
        <feature type="LIN" n="2" name="2 LIN channels"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/49/infineon-cy8c41x5-cy8c41x6-psoc-4-high-voltage-hv-mixed-signal-ms-automotive-mcu-based-on-32-bit-arm-cortex--m0-datasheet-en.pdf?fileId=8ac78c8c956a0a470195817712a75d7a" title="PSoC4_HVMS64K Data sheet"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/57/infineon-psoc-4-high-voltagehvmixed-signalmsmcu-psoc4hvms-64k-registers-reference-manual-additionaltechnicalinformation-en.pdf" title="PSoC4_HVMS64K Register TRM"/>
        <device Dname="CY8C4126LCE-HVS003">
          <compile define="CY8C4126LCE_HVS003" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LCE-HVS013">
          <compile define="CY8C4126LCE_HVS013" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LDE-HVS004">
          <compile define="CY8C4126LDE_HVS004" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>  
        </device>
