vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
        <device Dname="CY8C4126LDE-HVS014">
          <compile define="CY8C4126LDE_HVS014" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LWE-HVS005">
          <compile define="CY8C4126LWE_HVS005" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LWE-HVS015">
          <compile define="CY8C4126LWE_HVS015" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LCE-HVS003">
          <compile define="CY8C4146LCE_HVS003" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LCE-HVS013">
          <compile define="CY8C4146LCE_HVS013" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LCE-HVS003X">
          <compile define="CY8C4146LCE_HVS003X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LCE-HVS013X">
          <compile define="CY8C4146LCE_HVS013X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>        
        <device Dname="CY8C4146LDE-HVS004">
          <compile define="CY8C4146LDE_HVS004" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>  
        </device>
        <device Dname="CY8C4146LDE-HVS014">
          <compile define="CY8C4146LDE_HVS014" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LDE-HVS004X">
          <compile define="CY8C4146LDE_HVS004X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LDE-HVS014X">
          <compile define="CY8C4146LDE_HVS014X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>        
        <device Dname="CY8C4146LWE-HVS005">
        <compile define="CY8C4146LWE_HVS005" />
        <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LWE-HVS015">
          <compile define="CY8C4146LWE_HVS015" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LWE-HVS005X">
          <compile define="CY8C4146LWE_HVS005X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LWE-HVS015X">
        <compile define="CY8C4146LWE_HVS015X" />
        <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>         
      </subFamily> 
      <subFamily DsubFamily="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx">
        <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" />
        <debug Pname="Cortex-M0p" svd="Libraries/mtb-pdl-cat2/devices/svd/psoc4hvms64k.svd" />
        <memory name="SRAM" access="rwx" start="0x20000000" size="0x00002000" default="1" />
        <memory name="FLASH" access="rx" start="0x00000000" size="0x00010000" default="1" startup="1" />
        <algorithm name="Flash/CAT2.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000300" RAMsize="0x00000D00" default="1" style="Keil" />
        <feature type="Memory" n="64" name="64KB FLASH Memory"/>
        <feature type="LIN" n="2" name="2 LIN channels"/>
        <feature type="IOs" n="41" name="General Purpose I/Os"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/49/infineon-cy8c41x5-cy8c41x6-psoc-4-high-voltage-hv-mixed-signal-ms-automotive-mcu-based-on-32-bit-arm-cortex--m0-datasheet-en.pdf?fileId=8ac78c8c956a0a470195817712a75d7a" title="PSoC4_HVMS64K Data sheet"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/57/infineon-psoc-4-high-voltagehvmixed-signalmsmcu-psoc4hvms-64k-registers-reference-manual-additionaltechnicalinformation-en.pdf" title="PSoC4_HVMS64K Register TRM"/>
        <device Dname="CY8C4126LCE-HVS103">
          <compile define="CY8C4126LCE_HVS103" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LCE-HVS113">
          <compile define="CY8C4126LCE_HVS113" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LDE-HVS104">
          <compile define="CY8C4126LDE_HVS104" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
