vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
        <device Dname="CY8C4126LDE-HVS114">
          <compile define="CY8C4126LDE_HVS114" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LWE-HVS105">
          <compile define="CY8C4126LWE_HVS105" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4126LWE-HVS115">
          <compile define="CY8C4126LWE_HVS115" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device> 
        <device Dname="CY8C4146LCE-HVS103">
          <compile define="CY8C4146LCE_HVS103" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LCE-HVS113">
          <compile define="CY8C4146LCE_HVS113" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LCE-HVS103X">
          <compile define="CY8C4146LCE_HVS103X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LCE-HVS113X">
          <compile define="CY8C4146LCE_HVS113X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="32"/>
          <feature type="IOs" n="18" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LDE-HVS104">
          <compile define="CY8C4146LDE_HVS104" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LDE-HVS114">
          <compile define="CY8C4146LDE_HVS114" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LDE-HVS104X">
          <compile define="CY8C4146LDE_HVS104X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LDE-HVS114X">
          <compile define="CY8C4146LDE_HVS114X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LWE-HVS105">
          <compile define="CY8C4146LWE_HVS105" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LWE-HVS115">
          <compile define="CY8C4146LWE_HVS115" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LWE-HVS105X">
          <compile define="CY8C4146LWE_HVS105X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4146LWE-HVS115X">
          <compile define="CY8C4146LWE_HVS115X" />
          <feature type="Memory" n="8" name="8KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>    
      </subFamily>
      <subFamily DsubFamily="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx">
        <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" />
        <debug Pname="Cortex-M0p" svd="Libraries/mtb-pdl-cat2/devices/svd/psoc4hvms128k.svd" />
        <memory name="SRAM" access="rwx" start="0x20000000" size="0x00004000" default="1" />
        <memory name="FLASH" access="rx" start="0x00000000" size="0x00020000" default="1" startup="1" />
        <algorithm name="Flash/CAT2.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000300" RAMsize="0x00000D00" default="1" style="Keil" />
        <feature type="Memory" n="128" name="128KB FLASH Memory"/>
        <feature type="LIN" n="2" name="2 LIN channels"/>
        <feature type="IOs" n="47" name="General Purpose I/Os"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/49/infineon-cy8c41x7-psoc-4-high-voltage-hv-mixed-signal-ms-automotive-mcu-based-on-32-bit-arm-cortex--m0-datasheet-en.pdf?fileId=8ac78c8c956a0a470195817786015ddd" title="PSoC4_HVMS128K Data sheet"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/57/infineon-psoc-high-voltagehvmixed-signal-msmcu-psoc-hvms-128k-registers-reference-manual-additionaltechnicalinformation-en.pdf" title="PSoC4_HVMS128K Register TRM"/>
        <device Dname="CY8C4127LDE-HVS004">
          <compile define="CY8C4127LDE_HVS004" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4127LDE-HVS014">
          <compile define="CY8C4127LDE_HVS014" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4127LWE-HVS005">
          <compile define="CY8C4127LWE_HVS005" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
