vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
        <device Dname="CY8C4127LWE-HVS015">
          <compile define="CY8C4127LWE_HVS015" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4127LQE-HVS006">
          <compile define="CY8C4127LQE_HVS006" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4127LQE-HVS016">
          <compile define="CY8C4127LQE_HVS016" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS004">
          <compile define="CY8C4147LDE_HVS004" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS014">
          <compile define="CY8C4147LDE_HVS014" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS024">
          <compile define="CY8C4147LDE_HVS024" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS034">
          <compile define="CY8C4147LDE_HVS034" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS024X">
          <compile define="CY8C4147LDE_HVS024X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS034X">
          <compile define="CY8C4147LDE_HVS034X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>        
        <device Dname="CY8C4147LWE-HVS005">
          <compile define="CY8C4147LWE_HVS005" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS015">
          <compile define="CY8C4147LWE_HVS015" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS025">
          <compile define="CY8C4147LWE_HVS025" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS035">
          <compile define="CY8C4147LWE_HVS035" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS025X">
          <compile define="CY8C4147LWE_HVS025X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS035X">
          <compile define="CY8C4147LWE_HVS035X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>        
        <device Dname="CY8C4147LQE-HVS006">
          <compile define="CY8C4147LQE_HVS006" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS016">
          <compile define="CY8C4147LQE_HVS016" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS026">
          <compile define="CY8C4147LQE_HVS026" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS036">
          <compile define="CY8C4147LQE_HVS036" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS026X">
          <compile define="CY8C4147LQE_HVS026X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS036X">
          <compile define="CY8C4147LQE_HVS036X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
      </subFamily>
      <subFamily DsubFamily="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx">
        <processor Pname="Cortex-M0p" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" />
        <debug Pname="Cortex-M0p" svd="Libraries/mtb-pdl-cat2/devices/svd/psoc4hvms128k.svd" />
        <memory name="SRAM" access="rwx" start="0x20000000" size="0x00004000" default="1" />
        <memory name="FLASH" access="rx" start="0x00000000" size="0x00020000" default="1" startup="1" />
        <algorithm name="Flash/CAT2.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000300" RAMsize="0x00000D00" default="1" style="Keil" />
        <feature type="Memory" n="128" name="128KB FLASH Memory"/>
        <feature type="LIN" n="2" name="2 LIN channels"/>
        <feature type="IOs" n="47" name="General Purpose I/Os"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/49/infineon-cy8c41x7-psoc-4-high-voltage-hv-mixed-signal-ms-automotive-mcu-based-on-32-bit-arm-cortex--m0-datasheet-en.pdf?fileId=8ac78c8c956a0a470195817786015ddd" title="PSoC4_HVMS128K Data sheet"/>
        <book name="https://www.infineon.com/assets/row/public/documents/10/57/infineon-psoc-high-voltagehvmixed-signal-msmcu-psoc-hvms-128k-registers-reference-manual-additionaltechnicalinformation-en.pdf" title="PSoC4_HVMS128K Register TRM"/>
        <device Dname="CY8C4127LDE-HVS104">
          <compile define="CY8C4127LDE_HVS104" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4127LDE-HVS114">
          <compile define="CY8C4127LDE_HVS114" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>        
        <device Dname="CY8C4127LWE-HVS105">
          <compile define="CY8C4127LWE_HVS105" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
