vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
        <device Dname="CY8C4127LWE-HVS115">
          <compile define="CY8C4127LWE_HVS115" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>        
        <device Dname="CY8C4127LQE-HVS106">
          <compile define="CY8C4127LQE_HVS106" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4127LQE-HVS116">
          <compile define="CY8C4127LQE_HVS116" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS104">
          <compile define="CY8C4147LDE_HVS104" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS114">
          <compile define="CY8C4147LDE_HVS114" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS124">
          <compile define="CY8C4147LDE_HVS124" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS134">
          <compile define="CY8C4147LDE_HVS134" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS124X">
          <compile define="CY8C4147LDE_HVS124X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LDE-HVS134X">
          <compile define="CY8C4147LDE_HVS134X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="48"/>
          <feature type="IOs" n="33" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS105">
          <compile define="CY8C4147LWE_HVS105" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS115">
          <compile define="CY8C4147LWE_HVS115" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS125">
          <compile define="CY8C4147LWE_HVS125" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS135">
          <compile define="CY8C4147LWE_HVS135" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS125X">
          <compile define="CY8C4147LWE_HVS125X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LWE-HVS135X">
          <compile define="CY8C4147LWE_HVS135X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="56"/>
          <feature type="IOs" n="41" name="General Purpose I/Os"/>
        </device>        
        <device Dname="CY8C4147LQE-HVS106">
          <compile define="CY8C4147LQE_HVS106" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS116">
          <compile define="CY8C4147LQE_HVS116" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS126">
          <compile define="CY8C4147LQE_HVS126" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS136">
          <compile define="CY8C4147LQE_HVS136" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS126X">
          <compile define="CY8C4147LQE_HVS126X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>
        <device Dname="CY8C4147LQE-HVS136X">
          <compile define="CY8C4147LQE_HVS136X" />
          <feature type="Memory" n="16" name="16KB SRAM"/>
          <feature type="QFN" n="64"/>
          <feature type="IOs" n="49" name="General Purpose I/Os"/>
        </device>        
      </subFamily>          
    </family>   
  </devices>

  <conditions>  
      <!-- Compiler Conditions -->
      <condition id="ARMCC">
        <require Tcompiler="ARMCC"/>
      </condition>
      <condition id="GCC">
        <require Tcompiler="GCC"/>
      </condition>
      <condition id="IAR">
        <require Tcompiler="IAR"/>
      </condition>

