vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
      <condition id="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx">
        <description>PSoC HVMS CY8C41x6LxE-HVS0xx series devices</description>
        <accept Dvendor="Infineon:7" Dname="CY8C4126LCE-HVS003" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LCE-HVS013" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LDE-HVS004" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LDE-HVS014" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LWE-HVS005" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LWE-HVS015" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS003" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS003X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS013" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS013X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS004" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS014" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS004X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS014X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS005" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS015" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS005X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS015X" />
      </condition>

      <condition id="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx">
        <description>PSoC HVMS CY8C41x6LxE-HVS1xx series devices</description>
        <accept Dvendor="Infineon:7" Dname="CY8C4126LCE-HVS103" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LCE-HVS113" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LDE-HVS104" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LDE-HVS114" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LWE-HVS105" />
        <accept Dvendor="Infineon:7" Dname="CY8C4126LWE-HVS115" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS103" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS113" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS103X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LCE-HVS113X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS104" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS114" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS104X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LDE-HVS114X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS105" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS115" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS105X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4146LWE-HVS115X" />
      </condition>

      <condition id="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx">
        <description>PSoC HVMS CY8C41x7LxE-HVS0xx series devices</description>
        <accept Dvendor="Infineon:7" Dname="CY8C4127LDE-HVS004" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LDE-HVS014" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LWE-HVS005" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LWE-HVS015" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LQE-HVS006" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LQE-HVS016" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS004" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS014" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS024" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS034" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS024X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS034X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS005" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS015" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS025" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS035" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS025X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS035X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS006" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS016" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS026" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS036" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS026X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS036X" />      
      </condition>

      <condition id="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx">
        <description>PSoC HVMS CY8C41x7LxE-HVS1xx series devices</description>
        <accept Dvendor="Infineon:7" Dname="CY8C4127LDE-HVS104" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LDE-HVS114" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LWE-HVS105" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LWE-HVS115" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LQE-HVS106" />
        <accept Dvendor="Infineon:7" Dname="CY8C4127LQE-HVS116" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS104" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS114" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS124" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS134" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS124X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LDE-HVS134X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS105" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS115" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS125" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS135" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS125X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LWE-HVS135X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS106" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS116" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS126" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS136" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS126X" />
        <accept Dvendor="Infineon:7" Dname="CY8C4147LQE-HVS136X" />
       </condition>       

      <condition id="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_GCC">
        <description>Infineon PSoC HVMS CY8C41x6LxE-HVS0xx Series devices compiled using GCC</description>
        <require condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx"/>
        <require condition="GCC"/>
      </condition>

