vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
      <condition id="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_ARMCC">
        <description>Infineon PSoC HVMS CY8C41x6LxE-HVS0xx Series devices compiled using ARMCC</description>
        <require condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx"/>
        <require condition="ARMCC"/>
      </condition>

      <condition id="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_IAR">
        <description>Infineon PSoC HVMS CY8C41x6LxE-HVS0xx Series devices compiled using IAR</description>
        <require condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx"/>
        <require condition="IAR"/>
      </condition>

      <condition id="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_GCC">
        <description>Infineon PSoC HVMS CY8C41x6LxE-HVS1xx Series devices compiled using GCC</description>
        <require condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx"/>
        <require condition="GCC"/>
      </condition>

      <condition id="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_ARMCC">
        <description>Infineon PSoC HVMS CY8C41x6LxE-HVS1xx Series devices compiled using ARMCC</description>
        <require condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx"/>
        <require condition="ARMCC"/>
      </condition>

      <condition id="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_IAR">
        <description>Infineon PSoC HVMS CY8C41x6LxE-HVS1xx Series devices compiled using IAR</description>
        <require condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx"/>
        <require condition="IAR"/>
      </condition>

      <condition id="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_GCC">
        <description>Infineon PSoC HVMS CY8C41x7LxE-HVS0xx Series devices compiled using GCC</description>
        <require condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx"/>
        <require condition="GCC"/>
      </condition>

      <condition id="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_ARMCC">
        <description>Infineon PSoC HVMS CY8C41x7LxE-HVS0xx Series devices compiled using ARMCC</description>
        <require condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx"/>
        <require condition="ARMCC"/>
      </condition>

      <condition id="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_IAR">
        <description>Infineon PSoC HVMS CY8C41x7LxE-HVS0xx Series devices compiled using IAR</description>
        <require condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx"/>
        <require condition="IAR"/>
      </condition>

      <condition id="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_GCC">
        <description>Infineon PSoC HVMS CY8C41x7LxE-HVS1xx Series devices compiled using GCC</description>
        <require condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx"/>
        <require condition="GCC"/>
      </condition>

      <condition id="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_ARMCC">
        <description>Infineon PSoC HVMS CY8C41x7LxE-HVS1xx Series devices compiled using ARMCC</description>
        <require condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx"/>
        <require condition="ARMCC"/>
      </condition>

      <condition id="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_IAR">
        <description>Infineon PSoC HVMS CY8C41x7LxE-HVS1xx Series devices compiled using IAR</description>
        <require condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx"/>
        <require condition="IAR"/>
      </condition>

      <condition id="CM0P">
        <description>Infineon PSoC HVMS Series devices CM0P</description>
        <accept condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx"/>
        <accept condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx"/>
        <accept condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx"/>
        <accept condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx"/>
        <require Dcore="Cortex-M0+"/>
      </condition>

      <condition id="CMSIS">
        <description>Infineon PSoC HVMS Series devices and CMSIS-CORE</description>
        <accept condition="CM0P"/>
        <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>

      <condition id="CM0P CMSIS">
        <description>Infineon PSoC HVMS Series devices CM0P and CMSIS-CORE</description>
        <require condition="CM0P"/>
        <require Cclass="CMSIS" Cgroup="CORE"/>
        <require Cclass="Device" Cgroup="Peripheral Driver Library" Csub="PDL"/>
      </condition>      
   
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" condition="CM0P CMSIS" Cversion="1.0.0">
      <description>Cortex-M0+ System Startup for Infineon PSoC HVMS</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define CMSIS_device_header "cy_device.h"
      </RTE_Components_h>
      <files>
        <file category="include"       name="Libraries/core-lib/include/"/>
        <file category="include"       name="Libraries/mtb-pdl-cat2/devices/include/"/>
        <file category="include"       name="Libraries/mtb-pdl-cat2/drivers/include/"/>
        <file category="include"       name="Libraries/mtb-pdl-cat2/devices/include/"/>
        <file category="include"       name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/"/>      
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/system_cat2.c" attr="config" version="2.0"/>        
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms64k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_GCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms64k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_GCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms64k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_ARMCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms64k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_ARMCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms64k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_IAR"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms64k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_IAR"/>        
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_GCC_ARM/cy8c41x6xhvs.ld"  attr="config" version="1.0.0" condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_GCC"/> 
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_GCC_ARM/cy8c41x6xhvs.ld"  attr="config" version="1.0.0" condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_GCC"/>  
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_ARM/cy8c41x6xhvs.sct"  attr="config" version="1.0.0" condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_ARMCC"/>
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_ARM/cy8c41x6xhvs.sct"  attr="config" version="1.0.0" condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_ARMCC"/>
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_IAR/cy8c41x6xhvs.icf"  attr="config" version="1.0.0" condition="PSoC_HVMS_64KB_3V3_CY8C41x6LxE-HVS0xx_IAR"/> 
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_IAR/cy8c41x6xhvs.icf"  attr="config" version="1.0.0" condition="PSoC_HVMS_64KB_5V_CY8C41x6LxE-HVS1xx_IAR"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms128k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_GCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms128k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_GCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms128k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_ARMCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms128k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_ARMCC"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms128k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_IAR"/>
        <file category="source"        name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/startup_psoc4hvms128k.c"  attr="config" version="2.1.0" condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_IAR"/>        
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_GCC_ARM/cy8c41x7xhvs.ld"  attr="config" version="1.0.0" condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_GCC"/> 
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_GCC_ARM/cy8c41x7xhvs.ld"  attr="config" version="1.0.0" condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_GCC"/>  
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_ARM/cy8c41x7xhvs.sct"  attr="config" version="1.0.0" condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_ARMCC"/>
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_ARM/cy8c41x7xhvs.sct"  attr="config" version="1.0.0" condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_ARMCC"/>
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_IAR/cy8c41x7xhvs.icf"  attr="config" version="1.0.0" condition="PSoC_HVMS_128KB_3V3_CY8C41x7LxE-HVS0xx_IAR"/> 
        <file category="linkerScript"  name="Libraries/mtb-template-cat2/files/templates/COMPONENT_MTB/TOOLCHAIN_IAR/cy8c41x7xhvs.icf"  attr="config" version="1.0.0" condition="PSoC_HVMS_128KB_5V_CY8C41x7LxE-HVS1xx_IAR"/>
      </files>
    </component>
