vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.PSoC-HVMS_DFP.pdsc
    <component Cclass="Device" Cgroup="Peripheral Driver Library" Csub="PDL" condition="CMSIS" Cversion="3.10.0">
        <description>MTB CAT2 Peripheral driver library</description>
        <files>
          <file category="doc"     name="Libraries/mtb-pdl-cat2/docs/pdl_api_reference_manual/html/index.html"/>
          <file category="include" name="Libraries/mtb-pdl-cat2/drivers/include/"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_canfd.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_crwdt.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_crypto_aes.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_crypto_crc.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_crypto_hw.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_crypto_sha.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_crypto_trng.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_cryptolite_aes.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_cryptolite_rsa.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_cryptolite_sha.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_cryptolite_trng.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_csd.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_ctb.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_dmac.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_flash.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_gpio.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_hvss.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_i2s.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_lin.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_lpcomp.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_ltc.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_msc.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_msclp.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_ram.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_sar.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_scb_common.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_scb_ezi2c.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_scb_i2c.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_scb_spi.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_scb_uart.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_seglcd.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_smartio.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_sysclk.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_sysfault.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_sysint.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_syslib.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_syspm.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_systick.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_tcpwm_counter.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_tcpwm_pwm.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_tcpwm_quaddec.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_trigmux.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbfs_dev_drv.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbfs_dev_drv_io.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbfs_dev_drv_io_dma.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_bch.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_buck_boost.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_config_table.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_hpd.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_idac_ctrl.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_lf_counter.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_mux.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_phy.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_typec.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_usbpd_vbus_ctrl.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_wdc.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_wdt.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_can.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_dsadc.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_dsadc_achan.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_dsadc_calibration.c"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/cy_dsadc_dchan.c"/> 
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/COMPONENT_CM0P/TOOLCHAIN_ARM/cy_syslib_mdk.s" condition="ARMCC"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/COMPONENT_CM0P/TOOLCHAIN_IAR/cy_syslib_iar.s" condition="IAR"/>
          <file category="source"  name="Libraries/mtb-pdl-cat2/drivers/source/COMPONENT_CM0P/TOOLCHAIN_GCC_ARM/cy_syslib_gcc.S" condition="GCC"/>
        </files>
    </component>
  </components>  
</package>